# Unit 2; Data Management

## Introduction

Importing Numpy and Pandas

In [1]:
# Import pandas so we can actually use it
import numpy as np
import pandas as pd

Using Loaded Packages

In [2]:
tmp_data = [1, 2, 3, 4]
# 'sum', as the name implied, takes the sum
tmp_sum = np.sum(tmp_data)
print(tmp_sum)

10

In [3]:
# 'cumprod' is short for 'cummulative product'
print(np.cumprod(tmp_data))

[ 1  2  6 24]

Importing data with Pandas (excel spreadsheet)

In [4]:
df = pd.read_excel('demo_data.xlsm')

Importing data with Pandas (csv/tsv)

In [5]:
# csv file
df = pd.read_csv('demo_data.csv')
# tsv file
df = pd.read_csv('demo_data.tsv', sep='\t')

## Dataframe Querying

Viewing DataFrame contents

In [6]:
df = pd.read_excel('demo_data.xlsm')
print(df)

   ID Allele Sex (Biological)  Age
0   1      a                m   21
1   2      a                m   74
2   3      b                m   63
3   4      a                f   35
4   5      b                f   74
5   6      b                m   73
6   7      b                f   50
7   8      a                m   66
8   9      b                f   35
9  10      a                f   36

Querying DataFrames by Position (list-like slicing)

In [7]:
# Single element
df.iloc[0, 2]

'm'

In [8]:
# All on second row
df.iloc[1, :]

ID                   2
Allele               a
Sex (Biological)     m
Age                 74
Name: 1, dtype: object

In [9]:
# All elements on rows 2-4, columns 2 and 3
print(df.iloc[1:4, [1, 2]])

  Allele Sex (Biological)
1      a                m
2      b                m
3      a                f

Querying DataFrame by Index

In [10]:
# Single element
df.loc[0, "Age"]

21

In [11]:
# All elements for column "Allele"
df.loc[:, "Allele"]

0    a
1    a
2    b
3    a
4    b
5    b
6    b
7    a
8    b
9    a
Name: Allele, dtype: object

In [12]:
# The age and sex (in that order!) for row indices 6-8
df.loc[6:8, ["Age", "Sex (Biological)"]]

   Age Sex (Biological)
6   50                f
7   66                m
8   35                f

Querying DataFrame by Condition (Filtering)

In [13]:
# Select only records for allele 'b'
df[df.loc[:, "Allele"] == "b"]

   ID Allele Sex (Biological)  Age
2   3      b                m   63
4   5      b                f   74
5   6      b                m   73
6   7      b                f   50
8   9      b                f   35

In [14]:
# Select only records for males over 50
# Note we use ‘&’ instead of ‘and’, plus additional brackets
print(df[(df.loc[:, "Age"] > 50) & (df.loc[:, "Sex (Biological)"] == "m")])

   ID Allele Sex (Biological)  Age
1   2      a                m   74
2   3      b                m   63
5   6      b                m   73
7   8      a                m   66

Summarizing the DataFrame as a Whole

In [15]:
df.describe()

             ID       Age
count  10.00000  10.00000
mean    5.50000  52.70000
std     3.02765  19.77681
min     1.00000  21.00000
25%     3.25000  35.25000
50%     5.50000  56.50000
75%     7.75000  71.25000
max    10.00000  74.00000

## Manipulating DataFrame Data

Removing Rows/Columns; the 'drop' function

In [16]:
# Drop without inplace, single column
df2 = df.drop('Age', axis=1)
df2

   ID Allele Sex (Biological)
0   1      a                m
1   2      a                m
2   3      b                m
3   4      a                f
4   5      b                f
5   6      b                m
6   7      b                f
7   8      a                m
8   9      b                f
9  10      a                f

In [17]:
# Drop with inplace, fice rows (odd entries), on top of the prior command
df2.drop([1,3,5,7,9], axis=0, inplace=True)
df2

   ID Allele Sex (Biological)
0   1      a                m
2   3      b                m
4   5      b                f
6   7      b                f
8   9      b                f

Inserting New Data

In [18]:
# Insert a new column with the header "Name"
# NOTE: The size of the inserted list must be the same as that of the 
# DataFrame along the respective axis!
df2.loc[:, "Name"] = ["Alex", "Barnie", "Charles", "Dixie", "Ethan"]
df2

   ID Allele Sex (Biological)     Name
0   1      a                m     Alex
2   3      b                m   Barnie
4   5      b                f  Charles
6   7      b                f    Dixie
8   9      b                f    Ethan

Replacing Data

In [19]:
# Replace "Ethan" with "Earl"
df2.loc[8, "Name"] = "Earl"
df2

   ID Allele Sex (Biological)     Name
0   1      a                m     Alex
2   3      b                m   Barnie
4   5      b                f  Charles
6   7      b                f    Dixie
8   9      b                f     Earl

Changing the Row Index; 'set_index'

In [20]:
df3 = df2.set_index('ID', drop=False, inplace=False)
df3

    ID Allele Sex (Biological)     Name
ID
1    1      a                m     Alex
3    3      b                m   Barnie
5    5      b                f  Charles
7    7      b                f    Dixie
9    9      b                f     Earl

In [21]:
df3.set_index(['Name', 'Allele'], drop=True, inplace=True)
df3

                ID Sex (Biological)
Name    Allele
Alex    a        1                m
Barnie  b        3                m
Charles b        5                f
Dixie   b        7                f
Earl    b        9                f

Setting Row and Column Indices Explicitly

In [22]:
# Update the row’s labels to represent a study ID
# NOTE; much like data insertion, the size of the list must match the number 
# of rows (df.index) or columns (df.columns)!
df3.index = [1242, 1289, 1308, 1415, 1417]
df3

      ID Sex (Biological)
1242   1                m
1289   3                m
1308   5                f
1415   7                f
1417   9                f

Transposing (Flipping) the DataFrame

In [23]:
df3.T

                 1242 1289 1308 1415 1417
ID                  1    3    5    7    9
Sex (Biological)    m    m    f    f    f

Functions and DataFrames; Naive Application

In [24]:
# Calculate the cumulative sum of each column iteratively
result = np.sum(df3)
result

ID                     25
Sex (Biological)    mmfff
dtype: object

In [25]:
result = np.cumsum(df3)
print(result)

      ID Sex (Biological)
1242   1                m
1289   4               mm
1308   9              mmf
1415  16             mmff
1417  25            mmfff

Functions and DataFrames; the 'apply' Function

'apply' in Action:

In [26]:
def omit_if_smaller(x, s):
   if x < s:
     return 0
   else:
     return x
df3.loc[:, "ID"].apply(func=omit_if_smaller, s=5)

1242    0
1289    0
1308    5
1415    7
1417    9
Name: ID, dtype: int64

## Saving your data

Saving to CSV

In [27]:
df3.to_csv('output.csv')

Saving to Excel

In [28]:
df3.to_excel('output.xlsm')